HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
/*
FreeRTOS
Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
Modifications Copyright (C) 2023-2025 Renesas Electronics Corporation or its affiliates.

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
the Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 http://aws.amazon.com/freertos
 http://www.FreeRTOS.org
*/

/* C runtime includes. */
#include <stdio.h>
#include <string.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "event_groups.h"

/* Renesas includes. */
#include "platform.h"

/* Logging includes. */
#include "iot_logging_task.h"

/* Key provisioning includes. */
#include "aws_dev_mode_key_provisioning.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"

/* Demo includes */
#include "aws_clientcredential.h"
#include "demo_config.h"
#include "store.h"
#include "mqtt_agent_task.h"

/* Phase 8b 第3次 段階5-x: get_task_info() / TASK_INFO アクセス用。
 * gui_task からの xTaskNotifyGive で参照するタスクハンドル群を共有 singleton に
 * 集約し、legacy aws_demos と同じ task_info ベース wiring を復活させる。 */
#include "rx72n_envision_kit_system.h"
/* r_simple_glcdc_config_rx / r_simple_graphic_rx removed in Phase 8b 第3次
 * 段階5-1 first checkpoint (MR !85). LCD output now goes through emWin via
 * gui_task (legacy-aligned APPW_X_Setup → APPW_Init → APPW_CreateRoot
 * sequence). vApplicationLcdLogString() remains a stub until 段階5-2 wires
 * a logging window. */
extern void gui_task( void * pvParameters );

#define appmainGUI_TASK_STACK_SIZE                ( 4096 )
#define appmainGUI_TASK_PRIORITY                  ( tskIDLE_PRIORITY + 1 )

/* Phase 8b 第3次 段階5-4c-3 (rx72n-envision-kit#57): SD update task. */
extern void sdcard_task( void * pvParameters );

#define appmainSDCARD_TASK_STACK_SIZE             ( 4096 )
#define appmainSDCARD_TASK_PRIORITY               ( tskIDLE_PRIORITY + 1 )

/* Phase 8b 第3次 段階5-5 (rx72n-envision-kit#58): serial flash (Quad SPI) task.
 * legacy aws_demos main_task は xTaskCreate(serial_flash_task, "serial_flash",
 * RX72N_ENVISION_KIT_TASKS_STACK, &task_info, tskIDLE_PRIORITY, ...) で起動していた。
 * v3 baseline では task_info 共有と gui_task からの xTaskNotifyGive が未復活のため、
 * sdcard_task と同じローカル static handle / NULL pvParameters / +1 priority に揃える。
 * notify wiring の復活は段階5-x で gui_task と一括で行う想定。 */
extern void serial_flash_task( void * pvParameters );

#define appmainSERIAL_FLASH_TASK_STACK_SIZE       ( 4096 )
#define appmainSERIAL_FLASH_TASK_PRIORITY         ( tskIDLE_PRIORITY + 1 )

/* Phase 8b 第3次 段階5-6 (rx72n-envision-kit#59): audio task placeholder.
 * legacy aws_demos の audio_task.c も実装は永久 sleep のみで、実 audio 機能
 * (SSI codec / DMA driver) は無かった。本 wiring は将来の audio 機能実装に
 * 備えた main_task / TASK_INFO::audio_task_handle の placeholder。
 * sdcard / serial_flash と同じローカル static handle / get_task_info() pattern。 */
extern void audio_task( void * pvParameters );

#define appmainAUDIO_TASK_STACK_SIZE              ( 4096 )
#define appmainAUDIO_TASK_PRIORITY                ( tskIDLE_PRIORITY + 1 )

#ifndef appmainENABLE_BOARD_APPLICATION_TASKS
    #define appmainENABLE_BOARD_APPLICATION_TASKS ( 0 )
#endif

#ifndef appmainENABLE_BOARD_GUI_TASK
    #define appmainENABLE_BOARD_GUI_TASK appmainENABLE_BOARD_APPLICATION_TASKS
#endif

#ifndef appmainENABLE_BOARD_SDCARD_TASK
    #define appmainENABLE_BOARD_SDCARD_TASK appmainENABLE_BOARD_APPLICATION_TASKS
#endif

#ifndef appmainENABLE_BOARD_SERIAL_FLASH_TASK
    #define appmainENABLE_BOARD_SERIAL_FLASH_TASK appmainENABLE_BOARD_APPLICATION_TASKS
#endif

#ifndef appmainENABLE_BOARD_AUDIO_TASK
    #define appmainENABLE_BOARD_AUDIO_TASK appmainENABLE_BOARD_APPLICATION_TASKS
#endif

#define appmainENABLE_ANY_BOARD_APPLICATION_TASK    ( ( appmainENABLE_BOARD_GUI_TASK != 0 ) || \
                                                      ( appmainENABLE_BOARD_SDCARD_TASK != 0 ) || \
                                                      ( appmainENABLE_BOARD_SERIAL_FLASH_TASK != 0 ) || \
                                                      ( appmainENABLE_BOARD_AUDIO_TASK != 0 ) )

#define appmainENABLE_BOARD_GUI_DEPENDENCY         ( ( appmainENABLE_BOARD_GUI_TASK != 0 ) || \
                                                      ( appmainENABLE_BOARD_SDCARD_TASK != 0 ) || \
                                                      ( appmainENABLE_BOARD_SERIAL_FLASH_TASK != 0 ) || \
                                                      ( appmainENABLE_BOARD_AUDIO_TASK != 0 ) )

#ifndef appmainENABLE_NETWORK_WAIT_DIAGNOSTICS
    #define appmainENABLE_NETWORK_WAIT_DIAGNOSTICS appmainENABLE_ANY_BOARD_APPLICATION_TASK
#endif

#define appmainNETWORK_WAIT_LOG_INTERVAL_MS        ( 5000UL )

/* Phase 8b 第3次 段階5-7 B-1 (rx72n-envision-kit#60): TCP performance tasks.
 * iperf 互換 TCP throughput 測定。legacy aws_demos と同じ priority
 * configMAX_PRIORITIES (network throughput 優先)。両 task とも自走で
 * gui_task からの notify 不要。サーバ IP/port は B-1 では #define hardcode、
 * B-2 で KVStore 化予定。 */
extern void tcp_send_performance_task( void * pvParameters );
extern void tcp_receive_performance_task( void * pvParameters );

#define appmainTCP_PERF_TASK_STACK_SIZE           ( 4096 )
#define appmainTCP_PERF_TASK_PRIORITY             ( configMAX_PRIORITIES - 1 )

EventGroupHandle_t xStartDemoEventGroup = NULL;

bool ApplicationCounter (uint32_t xWaitTime);
signed char vISR_Routine (void);
extern void vStartSimplePubSubDemo (void);
BaseType_t OtaSelfTest(void);

BaseType_t vAssignCredentials(void);
extern int32_t xprvWriteCacheEntry(size_t KeyLength,
        char * Key,
        size_t ValueLength,
        char * pvNewValue );
extern BaseType_t KVStore_xCommitChanges(void);

