HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
#if (ENABLE_OTA_UPDATE_DEMO == 1)
    extern void vStartOtaDemo(void);
#endif

#if (ENABLE_FLEET_PROVISIONING_DEMO == 1)
    extern void vStartFleetProvisioningDemo(void);
#endif

/**
 * @brief Flag which enables OTA update task in background along with other demo tasks.
 * OTA update task polls regularly for firmware update jobs or acts on a new firmware update
 * available notification from OTA service.
 */
#define appmainINCLUDE_OTA_UPDATE_TASK            ( 1 )

/**
 * @brief Stack size and priority for OTA Update task.
 */
#define appmainMQTT_OTA_UPDATE_TASK_STACK_SIZE    ( 4096 )
#define appmainMQTT_OTA_UPDATE_TASK_PRIORITY      ( tskIDLE_PRIORITY )

/**
 * @brief Stack size and priority for MQTT agent task.
 * Stack size is capped to an adequate value based on requirements from MbedTLS stack
 * for establishing a TLS connection. Task priority of MQTT agent is set to a priority
 * higher than other MQTT application tasks, so that the agent can drain the queue
 * as work is being produced.
 */
#define appmainMQTT_AGENT_TASK_STACK_SIZE         ( 6144 )
#define appmainMQTT_AGENT_TASK_PRIORITY           ( tskIDLE_PRIORITY + 2 )

/**
 * @brief Stack size and priority for CLI task.
 */
#define appmainCLI_TASK_STACK_SIZE                ( 6144 )
#define appmainCLI_TASK_PRIORITY                  ( tskIDLE_PRIORITY + 1 )

#define mainLOGGING_TASK_STACK_SIZE               ( configMINIMAL_STACK_SIZE * 6 )
#define mainLOGGING_MESSAGE_QUEUE_LENGTH          ( 15 )
#define mainTEST_RUNNER_TASK_STACK_SIZE           ( configMINIMAL_STACK_SIZE * 8 )
#define UNSIGNED_SHORT_RANDOM_NUMBER_MASK         (0xFFFFUL)

#define mainUART_COMMAND_CONSOLE_STACK_SIZE ( configMINIMAL_STACK_SIZE * 6UL )
/* The priority used by the UART command console task. */
#define mainUART_COMMAND_CONSOLE_TASK_PRIORITY  ( 1 )

/* The MAC address array is not declared const as the MAC address will
normally be read from an EEPROM and not hard coded (in real deployed
applications).*/
static uint8_t ucMACAddress[6] =
{
    configMAC_ADDR0,
    configMAC_ADDR1,
    configMAC_ADDR2,
    configMAC_ADDR3,
    configMAC_ADDR4,
    configMAC_ADDR5
}; //XXX

/* Define the network addressing.  These parameters will be used if either
ipconfigUDE_DHCP is 0 or if ipconfigUSE_DHCP is 1 but DHCP auto configuration
failed. */
static const uint8_t ucIPAddress[4] =
{
    configIP_ADDR0,
    configIP_ADDR1,
    configIP_ADDR2,
    configIP_ADDR3
};
static const uint8_t ucNetMask[4] =
{
    configNET_MASK0,
    configNET_MASK1,
    configNET_MASK2,
    configNET_MASK3
};
static const uint8_t ucGatewayAddress[4] =
{
    configGATEWAY_ADDR0,
    configGATEWAY_ADDR1,
    configGATEWAY_ADDR2,
    configGATEWAY_ADDR3
};

/* The following is the address of an OpenDNS server. */
static const uint8_t ucDNSServerAddress[4] =
{
    configDNS_SERVER_ADDR0,
    configDNS_SERVER_ADDR1,
    configDNS_SERVER_ADDR2,
    configDNS_SERVER_ADDR3
};

extern int32_t littlFs_init (void);
extern void vSerialPutString(const signed char * pcString, unsigned short usStringLength);

/**
 * @brief Application task startup hook.
 */
void vApplicationDaemonTaskStartupHook (void);

/**
 * @brief Initializes the board.
 */
void prvMiscInitialization (void);
static BaseType_t prvShouldAutoProvisionFromClientCredentials( void );
static void prvDisplayInitialize( void );
static void prvStartBoardApplicationTasks( void );
static void prvDisplayWriteBanner( void );
static void prvDisplayWrite( const char * pcMessage );

extern void UserInitialization (void);
extern void CLI_Support_Settings (void);
extern void vUARTCommandConsoleStart (uint16_t usStackSize, UBaseType_t uxPriority);
extern void vRegisterSampleCLICommands (void);

static BaseType_t xDisplayInitialized = pdFALSE;

/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: main_task
 * Description  : The application entry point from a power on reset is PowerON_Reset_PC()
 *                in resetprg.c.
 * Return Value : .
 *********************************************************************************************************************/
void main_task(void *pvParameters)
{
    int32_t xResults;
    int32_t xCacheInitResult = LFS_ERR_OK;
    int32_t Time2Wait = 10000;
    BaseType_t xProceedToDemo = pdTRUE;
    extern void vRegisterSampleCLICommands (void);
    extern void vUARTCommandConsoleStart (uint16_t usStackSize, UBaseType_t uxPriority);
    extern TaskHandle_t xCLIHandle;

    (void) pvParameters;

    prvMiscInitialization();
    UserInitialization();

    /* Phase 8b 第3次 段階5-4c-3 (#57): code flash 排他制御用 semaphore を初期化。
     * sdcard_task / firm_update.c が xSemaphoreTake/Give する。
     * legacy aws_demos の main.c L164-165 と同じパターン。 */
    {
        extern SemaphoreHandle_t xSemaphoreCodeFlashAccess;
        xSemaphoreCodeFlashAccess = xSemaphoreCreateBinary();
        xSemaphoreGive( xSemaphoreCodeFlashAccess );
    }

    /* Keep LCD/SD/serial flash/audio out of the v3 baseline path.
     * Re-enable them from a dedicated app-layer job once MQTT is stable. */
#if (ENABLE_CREDENTIAL_BY_CLI == 1)
    {
        /* Register the standard CLI commands. */
        extern void vRegisterSdcardCLICommands(void); /* Phase 8b 第3次 段階5-4a (#53) */
        vRegisterSampleCLICommands();
        vRegisterSdcardCLICommands();
        vUARTCommandConsoleStart(mainUART_COMMAND_CONSOLE_STACK_SIZE, mainUART_COMMAND_CONSOLE_TASK_PRIORITY);
    }
#endif

    xResults = littlFs_init();
    prvDisplayWrite((LFS_ERR_OK == xResults) ? "LittleFS OK\r\n" : "LittleFS ERROR\r\n");

    xMQTTAgentInit();
    prvDisplayWrite("MQTT agent init\r\n");

    if (LFS_ERR_OK == xResults)
    {
        xCacheInitResult = vprvCacheInit();
    }

#if (ENABLE_CREDENTIAL_BY_CLI == 1)
    if( ( LFS_ERR_OK == xResults ) &&
        ( LFS_ERR_OK == xCacheInitResult ) &&
        ( pdTRUE == prvShouldAutoProvisionFromClientCredentials() ) )
    {
        vAssignCredentials();
    }
#endif

#if (ENABLE_CREDENTIAL_BY_CLI == 0)
    vAssignCredentials();
#else
    xProceedToDemo = ApplicationCounter(Time2Wait);
#endif

    if (pdTRUE == xProceedToDemo)
    {
    #if (ENABLE_CREDENTIAL_BY_CLI == 1)
        /* Remove CLI task before going to demo. */
        /* CLI and Log tasks use common resources but are not exclusively controlled. */
        /* For this reason, the CLI task must be deleted before executing the Demo. */
        if( xCLIHandle != NULL )
        {
            vTaskDelete(xCLIHandle);
        }
    #endif

        /* Initialise the RTOS's TCP/IP stack.  The tasks that use the network
            are created in the vApplicationIPNetworkEventHook() hook function
            below.  The hook function is called when the network connects. */
        prvDisplayWrite("Network init\r\n");

