HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
        FreeRTOS_IPInit(ucIPAddress,
                        ucNetMask,
                        ucGatewayAddress,
                        ucDNSServerAddress,
                        ucMACAddress );

        /* We should wait for the network to be up before we run any demos. */
#if ( appmainENABLE_NETWORK_WAIT_DIAGNOSTICS != 0 )
        {
            const TickType_t xNetworkWaitStartTick = xTaskGetTickCount();
            TickType_t xNetworkWaitLastLogTick = xNetworkWaitStartTick;
#endif
            while (FreeRTOS_IsNetworkUp() == pdFALSE)
            {
                vTaskDelay(pdMS_TO_TICKS(300));

#if ( appmainENABLE_NETWORK_WAIT_DIAGNOSTICS != 0 )
                {
                    const TickType_t xNetworkWaitNowTick = xTaskGetTickCount();

                    if( ( xNetworkWaitNowTick - xNetworkWaitLastLogTick ) >= pdMS_TO_TICKS( appmainNETWORK_WAIT_LOG_INTERVAL_MS ) )
                    {
                        xNetworkWaitLastLogTick = xNetworkWaitNowTick;
                        configPRINTF( ( "Network wait: up=%ld waited=%lu heap=%lu main_hwm=%lu\r\n",
                                        ( long ) FreeRTOS_IsNetworkUp(),
                                        ( unsigned long ) ( ( xNetworkWaitNowTick - xNetworkWaitStartTick ) * portTICK_PERIOD_MS ),
                                        ( unsigned long ) xPortGetFreeHeapSize(),
                                        ( unsigned long ) uxTaskGetStackHighWaterMark( NULL ) ) );
                    }
                }
#endif
            }

#if ( appmainENABLE_NETWORK_WAIT_DIAGNOSTICS != 0 )
            {
                const TickType_t xNetworkWaitEndTick = xTaskGetTickCount();

                configPRINTF( ( "Network wait done: waited=%lu heap=%lu main_hwm=%lu\r\n",
                                ( unsigned long ) ( ( xNetworkWaitEndTick - xNetworkWaitStartTick ) * portTICK_PERIOD_MS ),
                                ( unsigned long ) xPortGetFreeHeapSize(),
                                ( unsigned long ) uxTaskGetStackHighWaterMark( NULL ) ) );
            }
        }
#endif

        FreeRTOS_printf(("Initialise the RTOS's TCP/IP stack\n"));
        prvDisplayWrite("Network up\r\n");

        if( appmainENABLE_ANY_BOARD_APPLICATION_TASK != 0 )
        {
            prvStartBoardApplicationTasks();
            prvDisplayWrite("Board app tasks init\r\n");
        }

        /* Phase 8b 第3次 段階5-7 B-1 (#60): TCP performance tasks (iperf 互換) を起動。
         * CLI provisioning window を潰さないよう、demo 継続判定と network up 後に起動する。 */
        {
            static TaskHandle_t s_tcp_send_perf_task_handle = NULL;
            if( s_tcp_send_perf_task_handle == NULL )
            {
                ( void ) xTaskCreate( tcp_send_performance_task,
                                      "tcp_send_perf",
                                      appmainTCP_PERF_TASK_STACK_SIZE,
                                      get_task_info(),
                                      appmainTCP_PERF_TASK_PRIORITY,
                                      &s_tcp_send_perf_task_handle );
                get_task_info()->tcp_send_performance_task_handle = s_tcp_send_perf_task_handle;
            }
        }
        {
            static TaskHandle_t s_tcp_recv_perf_task_handle = NULL;
            if( s_tcp_recv_perf_task_handle == NULL )
            {
                ( void ) xTaskCreate( tcp_receive_performance_task,
                                      "tcp_recv_perf",
                                      appmainTCP_PERF_TASK_STACK_SIZE,
                                      get_task_info(),
                                      appmainTCP_PERF_TASK_PRIORITY,
                                      &s_tcp_recv_perf_task_handle );
                get_task_info()->tcp_receive_performance_task_handle = s_tcp_recv_perf_task_handle;
            }
        }

        /* Phase 8b 第3次 段階5-2 (rx72n-envision-kit#50): Tracealyzer recorder
         * の起動。FreeRTOS-Plus-TCP streamport (Middleware/3rdparty/
         * tracealyzer_recorder/streamports/FreeRTOS_Plus_TCP/) が socket を開いて
         * 初期接続するため、本タイミング (network up 確認後、demo task 起動前) に
         * vTraceEnable() を呼ぶ。Tracealyzer host 接続失敗時は port 内で
         * vTraceStop() が呼ばれ trace 出力は無効化される (boot は継続)。 */
        vTraceEnable( TRC_INIT );
        vTraceEnable( TRC_START );
        prvDisplayWrite("Tracealyzer init\r\n");

        FreeRTOS_printf(("---------STARTING DEMO---------\r\n"));
        prvDisplayWrite("Starting demo\r\n");

            #if (ENABLE_FLEET_PROVISIONING_DEMO == 1)
                vStartFleetProvisioningDemo();
            #else
                xSetMQTTAgentState(MQTT_AGENT_STATE_INITIALIZED);
            #endif

            vStartMQTTAgent (appmainMQTT_AGENT_TASK_STACK_SIZE, appmainMQTT_AGENT_TASK_PRIORITY);
            prvDisplayWrite("MQTT task start\r\n");

            vStartSimplePubSubDemo ();
            prvDisplayWrite("PubSub task start\r\n");

            #if (ENABLE_OTA_UPDATE_DEMO == 1)
                        vStartOtaDemo();
                        prvDisplayWrite("OTA task start\r\n");
            #endif
    }
    else
    {
        prvDisplayWrite("CLI mode active\r\n");
    }

    while (1)
    {
        vTaskSuspend(NULL);
    }
}
/*****************************************************************************************
End of function main_task
****************************************************************************************/
/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: prvMiscInitialization
 * Description  : .
 * Return Value : .
 *********************************************************************************************************************/
void prvMiscInitialization(void)
{
    /* Initialize UART for serial terminal. */
    CLI_Support_Settings();

    xStartDemoEventGroup = xEventGroupCreate();

    /* Start logging task. */
    xLoggingTaskInitialize(mainLOGGING_TASK_STACK_SIZE,
                            tskIDLE_PRIORITY + 2,
                            mainLOGGING_MESSAGE_QUEUE_LENGTH);

