HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
}
/*****************************************************************************************
End of function prvMiscInitialization
****************************************************************************************/
/*-----------------------------------------------------------*/

static void prvDisplayInitialize( void )
{
    static TaskHandle_t s_gui_task_handle = NULL;

    if( s_gui_task_handle == NULL )
    {
        ( void ) xTaskCreate( gui_task,
                              "gui",
                              appmainGUI_TASK_STACK_SIZE,
                              get_task_info(),
                              appmainGUI_TASK_PRIORITY,
                              &s_gui_task_handle );
        get_task_info()->gui_task_handle = s_gui_task_handle;
    }
}
/*-----------------------------------------------------------*/

static void prvStartBoardApplicationTasks( void )
{
    if( appmainENABLE_BOARD_GUI_DEPENDENCY != 0 )
    {
        prvDisplayInitialize();
    }

    /* Phase 8b 第3次 段階5-4c-3 (#57): SD update task を起動。
     * sdcard_task は SD カード挿抜検出 + 自動 mount + firm_update 進捗監視 +
     * GUI 連動を行う。gui_task の完了通知を待ってから動き始める設計。 */
    if( appmainENABLE_BOARD_SDCARD_TASK != 0 )
    {
        static TaskHandle_t s_sdcard_task_handle = NULL;
        if( s_sdcard_task_handle == NULL )
        {
            ( void ) xTaskCreate( sdcard_task,
                                  "sdcard",
                                  appmainSDCARD_TASK_STACK_SIZE,
                                  get_task_info(),
                                  appmainSDCARD_TASK_PRIORITY,
                                  &s_sdcard_task_handle );
            get_task_info()->sdcard_task_handle = s_sdcard_task_handle;
        }
    }

    /* Phase 8b 第3次 段階5-5 (#58): serial flash (Quad SPI) task を起動。
     * Macronix MX25L 32Mbit に対する erase/write/read テスト harness。
     * gui_task からの xTaskNotifyGive で wake-up される (段階5-x で復活)。 */
    if( appmainENABLE_BOARD_SERIAL_FLASH_TASK != 0 )
    {
        static TaskHandle_t s_serial_flash_task_handle = NULL;
        if( s_serial_flash_task_handle == NULL )
        {
            ( void ) xTaskCreate( serial_flash_task,
                                  "serial_flash",
                                  appmainSERIAL_FLASH_TASK_STACK_SIZE,
                                  get_task_info(),
                                  appmainSERIAL_FLASH_TASK_PRIORITY,
                                  &s_serial_flash_task_handle );
            get_task_info()->serial_flash_task_handle = s_serial_flash_task_handle;
        }
    }

    /* Phase 8b 第3次 段階5-6 (#59): audio task placeholder を起動。
     * legacy aws_demos と同じく実装は永久 sleep のみで、実 audio 機能は無い。
     * 段階5-6b 以降で SSI/DMA を取り込んだ際に本実装に差し替える。 */
    if( appmainENABLE_BOARD_AUDIO_TASK != 0 )
    {
        static TaskHandle_t s_audio_task_handle = NULL;
        if( s_audio_task_handle == NULL )
        {
            ( void ) xTaskCreate( audio_task,
                                  "audio",
                                  appmainAUDIO_TASK_STACK_SIZE,
                                  get_task_info(),
                                  appmainAUDIO_TASK_PRIORITY,
                                  &s_audio_task_handle );
            get_task_info()->audio_task_handle = s_audio_task_handle;
        }
    }
}
/*-----------------------------------------------------------*/

static void prvDisplayWriteBanner( void )
{
    char cVersionLine[96];

    prvDisplayWrite("\r\n");
    prvDisplayWrite("RX72N Envision Kit\r\n");
    prvDisplayWrite("AWS FreeRTOS IoT Reference\r\n");
    prvDisplayWrite("Implementation Demo\r\n");
    prvDisplayWrite("----------------------------------------\r\n");

    (void) sprintf(cVersionLine,
                   "Firmware: %u.%u.%u\r\n",
                   (unsigned int) APP_VERSION_MAJOR,
                   (unsigned int) APP_VERSION_MINOR,
                   (unsigned int) APP_VERSION_BUILD);
    prvDisplayWrite(cVersionLine);

    prvDisplayWrite("OS: " democonfigOS_NAME " " democonfigOS_VERSION "\r\n");
    prvDisplayWrite("MQTT: " democonfigMQTT_LIB "\r\n");

    (void) sprintf(cVersionLine,
                   "BSP: %u.%u\r\n",
                   (unsigned int) R_BSP_VERSION_MAJOR,
                   (unsigned int) R_BSP_VERSION_MINOR);
    prvDisplayWrite(cVersionLine);

    prvDisplayWrite("Built: " __DATE__ " " __TIME__ "\r\n");
    prvDisplayWrite("----------------------------------------\r\n");
}
/*-----------------------------------------------------------*/

static void prvDisplayWrite( const char * pcMessage )
{
    if( ( pdFALSE != xDisplayInitialized ) && ( NULL != pcMessage ) )
    {
        vApplicationLcdLogString(pcMessage, (unsigned short) strlen(pcMessage));
    }
}
/*-----------------------------------------------------------*/

void vApplicationLcdLogString( const char * pcMessage, unsigned short usStringLength )
{
    /* Stub: r_simple_graphic_rx removed.
     * Will be replaced with emWin GUI_DispString() in 段階5-2.
     * UART logging continues unaffected. */
    (void) pcMessage;
    (void) usStringLength;
}
/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationDaemonTaskStartupHook
 * Description  : .
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationDaemonTaskStartupHook(void)
{
}
/*****************************************************************************************
End of function vApplicationDaemonTaskStartupHook
****************************************************************************************/

/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationGetIdleTaskMemory
 * Description  : configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
 *                implementation of vApplicationGetIdleTaskMemory() to provide the memory that is
 *                used by the Idle task.
 * Arguments    : ppxIdleTaskTCBBuffer
 *              : ppxIdleTaskStackBuffer
 *              : pulIdleTaskStackSize
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationGetIdleTaskMemory(StaticTask_t ** ppxIdleTaskTCBBuffer,
                                    StackType_t ** ppxIdleTaskStackBuffer,
                                    uint32_t * pulIdleTaskStackSize)
{
    /* If the buffers to be provided to the Idle task are declared inside this
     * function then they must be declared static - otherwise they will be allocated on
     * the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[configMINIMAL_STACK_SIZE];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle
     * task's state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}
/*****************************************************************************************
End of function vApplicationGetIdleTaskMemory
****************************************************************************************/
/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationGetTimerTaskMemory
 * Description  : This is to provide the memory that is used by the RTOS daemon/time task.
 *
 *                If configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
 *                implementation of vApplicationGetTimerTaskMemory() to provide the memory that is
 *                used by the RTOS daemon/time task.
 * Arguments    : ppxTimerTaskTCBBuffer
 *              : ppxTimerTaskStackBuffer
 *              : pulTimerTaskStackSize
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationGetTimerTaskMemory(StaticTask_t ** ppxTimerTaskTCBBuffer,
                                    StackType_t ** ppxTimerTaskStackBuffer,
                                    uint32_t * pulTimerTaskStackSize)
{
    /* If the buffers to be provided to the Timer task are declared inside this
     * function then they must be declared static - otherwise they will be allocated on
     * the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle
     * task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}
/*****************************************************************************************
End of function vApplicationGetTimerTaskMemory
****************************************************************************************/
/*-----------------------------------------------------------*/

#ifndef iotconfigUSE_PORT_SPECIFIC_HOOKS

/**********************************************************************************************************************
 * Function Name: vApplicationMallocFailedHook
 * Description  : Warn user if pvPortMalloc fails.
 *
 *                Called if a call to pvPortMalloc() fails because there is insufficient
 *                free memory available in the FreeRTOS heap.  pvPortMalloc() is called
 *                internally by FreeRTOS API functions that create tasks, queues, software
 *                timers, and semaphores.  The size of the FreeRTOS heap is set by the
 *                configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h.
 * Argument     :
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationMallocFailedHook( void )
    {
        configPRINT_STRING(("ERROR: Malloc failed to allocate memory\r\n"));
        taskDISABLE_INTERRUPTS();

        for (;;)
        {
            /* Loop forever */
        }
    }
/*****************************************************************************************
End of function vApplicationMallocFailedHook
****************************************************************************************/

/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationStackOverflowHook
 * Description  : Loop forever if stack overflow is detected.
 *                If configCHECK_FOR_STACK_OVERFLOW is set to 1,
 *                this hook provides a location for applications to
 *                define a response to a stack overflow.
 *
 *                Use this hook to help identify that a stack overflow
 *                has occurred.
 * Arguments    : xTask
 *              : pcTaskName
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationStackOverflowHook(TaskHandle_t xTask,
                                        char * pcTaskName)
    {
        configPRINT_STRING(("ERROR: stack overflow\r\n"));
        portDISABLE_INTERRUPTS();

        /* Unused Parameters */
        (void) xTask;
        (void) pcTaskName;

        for (;;)
        {
            /* Loop forever */
        }
    }
/*****************************************************************************************
End of function vApplicationStackOverflowHook
****************************************************************************************/

